In [1]:
import pandas as pd
def clean_price_column(df, column):
	df[df[column]apply(lambda x:x.isnumeric())]
	df[column].fillna(0)
	df[column].astype(float)
	return df

SyntaxError: invalid syntax (<ipython-input-1-26d6f107b666>, line 3)

# Clean (remove non-numbers, fillna, change type, rename column)

In [39]:
import pandas as pd
from io import StringIO

data = """
id,name,value,category,number
1,A,$4,cat,2
2,B,$5,dog,3
3,C,cat,1
tt,D,$6.1,dog,4
4,E,43,c,5.5
5,F,23.5,d
de,G,0,e,0
"""

df = pd.read_csv(StringIO(data))
df

   id name value category  number
0   1    A    $4      cat     2.0
1   2    B    $5      dog     3.0
2   3    C   cat        1     NaN
3  tt    D  $6.1      dog     4.0
4   4    E    43        c     5.5
5   5    F  23.5        d     NaN
6  de    G     0        e     0.0

In [4]:
#keep numeric "id"s

df[df.id.apply(lambda x: x.isnumeric())]

  id name value category  number
0  1    A    $4      cat     2.0
1  2    B    $5      dog     3.0
2  3    C   cat        1     NaN
4  4    E    43        c     5.5
5  5    F  23.5        d     NaN

In [144]:
#fillna and change type

df['number'] = df['number'].fillna(0)
df['number'] = df['number'].astype(int)
df

#rename col
df = df.rename(columns={'id': 'id1'})
df
# l=[]
# for i in range(len(df['number'])):   
#     l.append(type(df['number'][i]))
# l

  id1 name value category  number   num   nmb
0   1    A    $4      cat       2   5.0  45.0
1   2    B    $5      dog       3   6.0  67.0
2   3    C   cat        1       4   5.7   NaN
3  tt    D  $6.1      dog       4   6.0   0.4
4   4    E    43        c       5   3.0  -6.0
5   5    F  23.5        d       0  45.1  -8.0
6  de    G     0        e       0   0.0 -94.0

# highest correlation w/ a specific column

In [85]:
import pandas as pd
from io import StringIO

data = """
id,name,value,category,number, num, nmb
1,A,$4,cat,2,5,45
2,B,$5,dog,3,6,67
3,C,cat,1,4,5.7
tt,D,$6.1,dog,4,6,0.4
4,E,43,c,5.5,3,-6
5,F,23.5,d,,45.1,-8
de,G,0,e,0,0,-94
"""

df = pd.read_csv(StringIO(data))
df

   id name value category  number   num   nmb
0   1    A    $4      cat     2.0   5.0  45.0
1   2    B    $5      dog     3.0   6.0  67.0
2   3    C   cat        1     4.0   5.7   NaN
3  tt    D  $6.1      dog     4.0   6.0   0.4
4   4    E    43        c     5.5   3.0  -6.0
5   5    F  23.5        d     NaN  45.1  -8.0
6  de    G     0        e     0.0   0.0 -94.0

In [139]:
df.corr()

          number       num       nmb
number  1.000000  0.530187  0.435166
 num    0.530187  1.000000  0.043107
 nmb    0.435166  0.043107  1.000000

In [138]:
df.corr()['number']

number    1.000000
 num      0.530187
 nmb      0.435166
Name: number, dtype: float64

In [140]:
l = (abs((df.corr().number)[1:]))
par = l.idxmax()
par

' num'

In [141]:
df.columns

Index(['id', 'name', 'value', 'category', 'number', ' num', ' nmb'], dtype='object')

In [142]:
def highest_corr(df, column):

    return abs(df.corr()[column][1:]).idxmax()

highest_corr(df, 'number')

' num'

# categorical features at a ertain level (+ drop column)

In [145]:
import pandas as pd
from io import StringIO

data = """
id,name,value,category,number, num, nmb
1,A,$4,cat,2,5,45
2,B,$5,dog,3,6,67
3,C,cat,1,4,5.7
tt,D,$6.1,dog,4,6,0.4
4,E,43,c,5.5,3,-6
5,F,23.5,d,,45.1,-8
de,G,0,e,0,0,-94
"""

df = pd.read_csv(StringIO(data))
df

   id name value category  number   num   nmb
0   1    A    $4      cat     2.0   5.0  45.0
1   2    B    $5      dog     3.0   6.0  67.0
2   3    C   cat        1     4.0   5.7   NaN
3  tt    D  $6.1      dog     4.0   6.0   0.4
4   4    E    43        c     5.5   3.0  -6.0
5   5    F  23.5        d     NaN  45.1  -8.0
6  de    G     0        e     0.0   0.0 -94.0

In [150]:
def extract_categs(df, target):
    _df = df.drop(target, axis=1)
    return _df

extract_categs(df, 'name')

   id value category  number   num   nmb
0   1    $4      cat     2.0   5.0  45.0
1   2    $5      dog     3.0   6.0  67.0
2   3   cat        1     4.0   5.7   NaN
3  tt  $6.1      dog     4.0   6.0   0.4
4   4    43        c     5.5   3.0  -6.0
5   5  23.5        d     NaN  45.1  -8.0
6  de     0        e     0.0   0.0 -94.0

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        7 non-null      object
 1   name      7 non-null      object
 2   value     7 non-null      object
 3   category  7 non-null      object
 4   number    6 non-null      float64
 5    num      7 non-null      float64
 6    nmb      6 non-null      float64
dtypes: float64(3), object(4)
memory usage: 520.0+ bytes

In [174]:
col = 'name'
df[col].unique()

array(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype=object)

In [188]:
for col in df.columns:
    print("column \"{}\" has {} unique values as: {}".format(col, len(df[col].unique()), df[col].unique()))

column "id" has 7 unique values as: ['1' '2' '3' 'tt' '4' '5' 'de']
column "name" has 7 unique values as: ['A' 'B' 'C' 'D' 'E' 'F' 'G']
column "value" has 7 unique values as: ['$4' '$5' 'cat' '$6.1' '43' '23.5' '0']
column "category" has 6 unique values as: ['cat' 'dog' '1' 'c' 'd' 'e']
column "number" has 6 unique values as: [2.  3.  4.  5.5 nan 0. ]
column " num" has 6 unique values as: [ 5.   6.   5.7  3.  45.1  0. ]
column " nmb" has 7 unique values as: [ 45.   67.    nan   0.4  -6.   -8.  -94. ]

In [173]:
def extract_categorical_features(df, n_levels, target):
    categoricals = []
    for col in df.columns:
        if (df[col].dtype == object) & (len(df[col].unique()) == n_levels) & (col != target):
            categoricals.append(col)
    return categoricals

In [177]:
extract_categorical_features(df, 7, 'name')

['id', 'value']